var app = angular.module('myApp', []);
app.controller('myController', function($scope) {
	
	//init value
	$scope.award = false;
	$scope.answered = false;
	$scope.fail = false;
	$scope.answeredQuestion = 0;
	$scope.corrected = 0;
	$scope.completed = false;
	
	//counter
	setInterval(function(){
		$scope.save();
	}, 60000)
	
	i = 60;
	function onTimer() {
	  document.getElementById('mycounter').innerHTML = "Your time left: "+i;
	  i--;
	  if (i < 0) {
		window.location.replace("index.html");
	  }
	  else {
		setTimeout(onTimer, 1000);
	  }
	}
	onTimer();
	$scope.nextQuestion = function(){
		if($scope.answeredQuestion<4){
			$scope.answeredQuestion++;
			 $scope.question = $scope.questions[Math.floor(Math.random() * $scope.questions.length)];
			 $scope.answered = false;
			 $scope.award = false;
			 $scope.fail = false;
		}else{
			$scope.completed = true;
			$scope.answered = false;
			 $scope.award = false;
			 $scope.fail = false;
			 $scope.question = {"question":"ফলাফল : "+$scope.corrected+" টি সঠিক হয়েছে।"};
		}
	}
	
	
	//qeustions
	$scope.questions = [
	{
		"question":"বাংলাদেশ  কত সালে  স্বাধীনতা অর্জন করে?",
		"options":["১৯৭২","১৯৭৩","১৯৭১","১৯৭৫"],
		"answer":2
	},
	{
		"question":"বাংলাদেশের  প্রথম এভারেস্ট জয়ীর নাম ?",
		"options":["মুসা ইব্রাহীম ","আমিনুল ইসলাম","ইমরান হোসেন","সাকিব-আল-হাসান"],
		"answer":0
	},
	
{
		"question":"বাংলাদেশের বর্তমান সংসেদে কতজন নির্বাচিত মহিলা সদস্য আছেন ?",
		"options":["19","15","25","27"],
		"answer":1
	},
	{
		"question":"বাংলাদেশ শিক্ষামন্ত্রীর নাম কী?",
		"options":["ফারুক খান","দিলীপ বরুয়া","সৈয়দ আবুল হোসেন","নূরুল ইসলাম নাহিদ"],
		"answer":3
	},
	{
		"question":"বর্তমান দেশে বিভাগ কতটি ?",
		"options":["6","7","8","9"],
		"answer":2
	},
	{
		"question":"আয়তনে বাংলাদেশের বড় বিভাগ কোনটি:?",
		"options":["ঢাকা","চট্টগ্রাম","রাজশাহী","রংপুর"],
		"answer":1
	},
	{
		"question":"বাংলাদেশে সবচেয়ে ছোট বিভাগ কোনটি ?",
		"options":["ময়মনসিংহ","সিলেট","বরিশাল","রাজশাহী"],
		"answer":0
	}
	,
	{
		"question":"বাংলাদেশের বৃহত্তম জেলা কোনটি?",
		"options":["ঢাকা","রাজশাহী","রাঙ্গামাটি","সিলেট"],
		"answer":2
	} 
	,
	{
		"question":"আয়তনে  বাংলাদেশের বৃহত্তম জেলা কোনটি?",
		"options":["ঢাকা","রাঙ্গামাটি","রাজশাহী","সিলেট"],
		"answer":1
	} 
	,
	{
		"question":"বাংলাদেশের ক্ষুদ্রতম জেলা কোনটি?",
		"options":["নারায়নগঞ্জ","সিলেট","রংপুর","ঢাকা"],
		"answer":0
	} 
	,
	{
		"question":"জনসংখ্যায় বাংলাদেশে ক্ষুদ্রতম জেলা কোনটি?",
		"options":["বান্দরবন","ফেনী","ঢাকা","রংপুর"],
		"answer":0
	} 
	,
	{
		"question":"বাংলাদেশে বর্তমানে সিটি করপোরেশন কয়টি?",
		"options":["9","10","11","12"],
		"answer":2
	} 
	,
	{
		"question":"বাংলাদেশে উপজেলা কয়টি?",
		"options":["476","486","491","490"],
		"answer":2
	} 
	,
	{
		"question":"বাংলাদেশে বৃহত্তম উপজেলা কোনটি?",
		"options":["শ্যামনগর","ঘাটাইল","সাভার","বরকল"],
		"answer":0
	} 
	,
	{
		"question":"ধান উৎপাদনে পৃথিবীতে  বাংলাদেশে অবস্থান কত?",
		"options":["2য়","3য়","4র্থ","5ম"],
		"answer":2
	} 
	,
	{
		"question":"বিশ্বের পোশাক রপ্তানিতে বাংলাদেশে অবস্থান কত?",
		"options":["1ম","2য়","3য়","4র্থ"],
		"answer":1
	} 
	,
	{
		"question":"বাংলাদেশে বেসরকারি  টিভি চ্যানেলের সংখ্যা কত?",
		"options":["38","40","42","44"],
		"answer":0
	} 
	,
	{
		"question":"বাংলাদেশে সর্ব প্রথম ডিজিটাল জেলা কোনটি?",
		"options":["যশোর","ঢাকা","ময়মনসিংহ","রংপুর"],
		"answer":0
	} 
	,
	{
		"question":"বাংলার প্রথম মুসলিম বিজেতা কে?",
		"options":["বখতিয়ার খলজী","ইলিয়াস শাহ","হোসেন শাহ","শিরিন খলজী"],
		"answer":0
	} 
	,
	{
		"question":"ইবনে বতুতা কোন দেশের পর্যটক?",
		"options":["ইতালি","মরোক্ক","তিব্বত","গ্রিন্স"],
		"answer":1
	} 
	,
	{
		"question":"ঢাকা কখন সর্ব প্রথম বাংলা রাজধানী হয়?",
		"options":["1255","1610","1905","1947"],
		"answer":1
	} 
	,
	{
		"question":"ঢাকা সর্ব প্রথম কে রাজধানী স্থাপন করেন?",
		"options":["সম্রাট  আকবর","সম্রাট জাহাঙ্গীর","ইসলাম খাঁ","শায়েস্তা খান"],
		"answer":2
	} 
	,
	{
		"question":"বাংলাদেশের রাজধানী কোথায়?",
		"options":["ঢাকা উত্তর","ঢাকা দক্ষিন","ঢাকা","শেরে বাংলা নগর"],
		"answer":2
	} 
	,
	{
		"question":"ঢাকার ধোলাই খাল কে খনন করেন?",
		"options":["পরিবীবি","ইসলাম খান","শায়েস্তা খান","ঈশা খা"],
		"answer":1
	} 
	,
	{
		"question":"ঢাকা গেইট কে নির্মান করেন?",
		"options":["শায়েস্তা খান","ইসলাম খান","মীর জুমলা","পরিবীবি"],
		"answer":2
	} 
	,
	{
		"question":"বাংলাদেশের প্রথম স্বাধীন নবাব কে?",
		"options":["সিরাজউদ্দৌলা","ইসলাম খা","ঈশা খা","শায়েস্তা খা"],
		"answer":0
	} 
	,
	{
		"question":"কত সালে নবাব সিরাজউদ্দৌলা বাংলার সিংহাসনে বসেন?",
		"options":["1756","1856","1757","1857"],
		"answer":0
	} 
	,
	{
		"question":"পলাশী যুদ্ধ কত সালে হয়?",
		"options":["1770","1757","1857","1880"],
		"answer":1
	} 
	,
	{
		"question":"বক্সারের যুদ্ধ কত সারে সংঘঠিত হয়?",
		"options":["1660","1707","1757","1764"],
		"answer":3
	} 
	,
	{
		"question":"মীর কাশেম বাংলার রাজধানী কোথায় স্থানাস্তর করেন?",
		"options":["ঢাকা","রংপুর","ফেনী","মুঙ্গের"],
		"answer":3
	} 
	,
	{
		"question":"কলকাতা কোন নদীর তীরে অবস্থিত ?",
		"options":["যমুনা","হোগলী","পদ্মা","গঙ্গা"],
		"answer":1
	} 
	,
	{
		"question":"ইংরেজরা বাংলাদেশে আগমন করেন কখন?",
		"options":["1599","1757","1475","1600"],
		"answer":1
	} 
	,
	{
		"question":"কলকাতা নগরের প্রতিষ্ঠাতা কে?",
		"options":["ক্লাইভ","ঢাল হোসী","ওয়েলী","জব চানর্ক"],
		"answer":3
	} 
	,
	{
		"question":"অবিভক্ত বাংলার মূখ্যমন্ত্রীর নাম কী?",
		"options":["আবুল কাশেম","এ কে এম ফজলুল হক","আব্দুল হামিদ খান  ভাসানী","খাজা নাজীম উদ্দিন"],
		"answer":1
	} 
	,
	{
		"question":"লাহোর প্রস্তাব কে উপস্থাপন করেন?",
		"options":["লিয়াকত আলী খান","এ কে  এম  ফজলুল হক","খাজা নাজীম উদ্দিন","হোসেন শহীদ সোহরাওয়াদী"],
		"answer":1
	} 
	,
	{
		"question":"1947 সালে পূর্ব বাংলার মূখ্যমন্ত্রীর নাম কী?",
		"options":["নূরুল আমিন","আতাউর রহমান","খাজা নাজিম উদ্দিন","আবুহোসেন সরকার"],
		"answer":2
	} 
	,
	{
		"question":"জমিদারী প্রথা বিলুপ্ত  হয় কত সালে?",
		"options":["1947","1950","1952","1964"],
		"answer":1
	} 
	,
	{
		"question":"তমুদ্দুন মজলিস কোন সালে প্রতিষ্ঠিত হয়?",
		"options":["1946","1947","1948","1950"],
		"answer":1
	} 
	,
	{
		"question":"ভাষা আন্দোলনে সূত্রপাত  হয় কত সালে?",
		"options":["1948","1950","1951","1952"],
		"answer":0
	} 
	,
	{
		"question":"কত সালে রাষ্ট্রভাষা সংগ্রাম পরিষদ গঠিত হয়?",
		"options":["1948","1949","1950","1951"],
		"answer":0
	} 
	,
	{
		"question":"সর্বদলীয় রাষ্ট্রভাষা সংগ্রাম কমিটি কোন সালে গঠিত হয়?",
		"options":["1948","1950","1952","1951"],
		"answer":2
	} 
	,
	{
		"question":"১৯৫২ সালে একুশে ফ্রেরুয়ারী বাংলা সাল কত ছিল?",
		"options":["১৩৫৮","১৩৫৯","১৩৬০","১৩৬১"],
		"answer":0
	} 
	,
	{
		"question":"কে ভাষা শহীদ নন?",
		"options":["নূর হোসেন","রফিক","জব্বার","সালাম"],
		"answer":0
	} 
	,
	{
		"question":"ভাষা আন্দোলনে সময় পাকিস্তানের প্রধানমন্ত্রীর কে ছিলেন?",
		"options":["খাজা নাজিম উদ্দিন","নুরুল আমিন","লিয়াকত আলী","মুহাম্মদ আলী জিন্নাহ"],
		"answer":0
	} 
	,
	{
		"question":"১৯৫২ সালে তৎকালীন ভাষা আন্দোলন কিসের জম্ম দিয়েছিল?",
		"options":["এক রাজনৈতিক মতবাদের","এক সাংস্কৃতিক আন্দোলনের ","এক নতুন জাতীয় চেতনার","এক নতুন সমাজ ব্যবস্থার"],
		"answer":2
	} 
	,
	{
		"question":"আন্তর্জাতিক মাতৃভাষা দিবস প্রথম বছরে কয়টি দেশ পালন করে?",
		"options":["176","188","187","190"],
		"answer":1
	} 
	,
	
	{
		"question":"জনসংখ্যার দিক থেকে পৃথিবীতে বর্তমানে বাংলা ভাষা স্থান  কত?",
		"options":["7ম","8ম","9ম1","10ম"],
		"answer":1
	} 
	,
	{
		"question":"বাংলা ভাষা প্রচলন আইন জারি হয়?",
		"options":["1952","1987","1991","1990"],
		"answer":1
	} 
	,
	{
		"question":"বাংলা কোন দেশের  দ্বিতীয় সরকারি ভাষা?",
		"options":["ভারত","নেপাল","সিয়েরালিওন","ভুটান"],
		"answer":2
	} 
	,
	{
		"question":"দেশের বাইরে প্রথম শহীদ মিনার নিমির্ত হয় কোথায়?",
		"options":["ইতালি","জাপান","ভারত","ভুটান"],
		"answer":1
	} 
	,
	{
		"question":"পূর্ব বাংলায় যুক্তফ্রন্ট কত সালে গঠন  করা হয়?",
		"options":["1953","1954","1955","1956"],
		"answer":0
	} 
	,
	{
		"question":"1954 সালের নির্বাচনে কোন দল জয় লাভ করেন?",
		"options":["মুসলিম লীগ","কংগ্রেস","ন্যাপ","যুক্তফ্রন্ট"],
		"answer":3
	} 
	,
	{
		"question":"1954 সালে পূর্ব পাকিস্তানের প্রাদেশিক পরিষদ নিবার্চনে যুক্তফ্রন্টের প্রতীক কী ছিল?",
		"options":["নৌকা","আনারস","লাঙ্গল","বাই সাইকেল"],
		"answer":0
	} 
	,
	{
		"question":"বাংলা একাডেমির মূল ভবনের নাম কি ছিল?",
		"options":["বর্ধমান হাউজ","কার্জন হল","মেয়র ভবন","আহসান মঞ্জিল"],
		"answer":0
	} 
	,
	{
		"question":"ঢাকা কোন নদীর তীরে অবস্থিত?",
		"options":["পদ্মা","মেঘনা","বুড়িগঙ্গা","যমুনা"],
		"answer":2
	} 
	,
	{
		"question":"ছয় দফা দাবি প্রথম কোথায়  উত্থাপন করা হয়?",
		"options":["ঢাকায়","কলকাতা","লাহোর","করাচি"],
		"answer":2
	} 
	,
	{
		"question":"আওয়ামী লীগ ছয় দফা  কোন সালে পেশ করা হয়েছিল?",
		"options":["1965","1966","1967","1955"],
		"answer":1
	} 
	,
	{
		"question":"ছয় দফা কর্মসূচি ঘোষণা করেন কে?",
		"options":["মাওলানা ভাষানী","কমরেড মুজাফফর আহমদ","বঙ্গবন্ধু শেখ মুজিবুর রহমান","হোসেন শহীদ সোহরাওয়াদী"],
		"answer":2
	} 
	,
	{
		"question":"আগরতলা ষড়যন্ত্র মামলা দায়ের হয় কোথায়?",
		"options":["আগরতলা","ঢাকা","লাহোর","করাচি"],
		"answer":1
	} 
	,
	{
		"question":"আগরতলা মামলায় কতজন আসামি ছিল?",
		"options":["19","35","20","40"],
		"answer":1
	}
	,
	{
		"question":"আসাদ শহীদ হন?",
		"options":["৯০ গণ আন্দোলনে","৫২ ভাষা আন্দোলনে","৬২ শিক্ষা আন্দোলনে","৭৯ গণ আন্দোলনে"],
		"answer":3
	}
	,
	{
		"question":"শেখ মজিবুর রহমান বঙ্গবন্ধু উপাধি পান ?",
		"options":["শ্রমিক সভায়","ছাত্র সভায়","জন সভায়","কৃষক সভায়"],
		"answer":1
	}
	,
	{
		"question":"১১ দফা কর্মসূচি ঘোষণা করেন কে?",
		"options":["মুসলিম লীগ","আওয়ামী লীগ","সর্বদলীয় ছাত্র সংগ্রাম পরিষদ","কংগ্রেস"],
		"answer":2
	}
	,
	{
		"question":"১১ দফা  আন্দোলন কখন হয়েছিল?",
		"options":["1954","1966","1968","1969"],
		"answer":3
	}
	,
	{
		"question":"১৯৭১ সালের ২৫ মার্চ কি দিন ছিলো ?",
		"options":["বৃহস্পতি বার","শনিবার","রবিবার","সোমবার"],
		"answer":0
	}
	,
	{
		"question":"বাংলাদেশের জাতীয় দিবস কোনটি?",
		"options":["১৬ ডিসেম্বর","২৬  মার্চ","২১ ফ্রেরুয়ারী","৭ ই মার্চ"],
		"answer":1
	}
	,
	{
		"question":"বাংলাদেশের প্রথম অস্থায়ী রাজধানীর নাম কী?",
		"options":["ঢাকা","মেহেরপুর","চট্টগ্রাম","মুজিবনগর"],
		"answer":3
	}
	,
	{
		"question":"মুজিবনগর কোথায় অবস্থিত?",
		"options":["সাতক্ষীরায়","মেহেরপুর","চুয়াডাঙ্গায়","নবাবগঞ্জে"],
		"answer":1
	}
	,
	{
		"question":"মুজিবনগর পূর্ব নাম কী ছিল?",
		"options":["মেহেরপুর","বৈদ্যনাথতলা","চন্দ্রনাথ","চুয়াডাঙ্গায়"],
		"answer":1
	}
	,
	{
		"question":"বাংলাদেশের প্রথম সরকার কোথায় গঠিত হয়?",
		"options":["ঢাকা","মুজিবনগর","গোপালগঞ্জ","যশোর"],
		"answer":1
	}
	,
	{
		"question":"বাংলাদেশের প্রথম স্যাটেলাইটের নাম কি?",
		"options":["টমাক","বাবর","স্পুটনিক১২১","বঙ্গবন্ধু-১"],
		"answer":3
	}
	,
	{
		"question":"বাংলাদেশ স্যটেলাইট  উৎক্ষেপনে কত তম দেশ?",
		"options":["৫৪ তম","৫০ তম ","৫৭ তম","৮২ তম"],
		"answer":2
	},
	{
		"question":"বাংলাদেশের প্রথম রাষ্ট্রপতি কে ছিলেন?",
		"options":["মোস্তাক আহমেদ","তাজউদ্দিন আহমেদ","মনসুর আলি","বঙ্গবন্ধু শেখ মুজিবুর রহমান"],
		"answer":3
	} ,
	{
		"question":"বাংলাদেশের প্রথম অস্থায়ী রাষ্ট্রপতির নাম কি?",
		"options":["মোস্তাক আহমেদ","তাজউদ্দিন আহমেদ","মনসুর আলি","সৈয়দ নজরুল ইসলাম"],
		"answer":3
	} ,
	{
		"question":"বাংলাদেশের স্বাধীনতার ঘোষণাপত্র পাঠ করা হয়  কোথায়",
		"options":["মুজিবনগর","তোতাপাড়া","সুন্দরপুর","তেতুলিয়া"],
		"answer":0
	},
	{
		"question":"বাংলাদেশের  প্রথম প্রধানমন্ত্রীর নাম কি",
		"options":["মোস্তাক আহমেদ","তাজউদ্দিন আহমেদ","মনসুর আলি","সৈয়দ নজরুল ইসলাম"],
		"answer":1
	},
	{
		"question":"বাংলাদেশের  প্রথম প্রতিরক্ষা মন্ত্রীর নাম কি",
		"options":["মোস্তাক আহমেদ","তাজউদ্দিন আহমেদ","মনসুর আলি","সৈয়দ নজরুল ইসলাম"],
		"answer":1
	},
	{
		"question":"বাংলাদেশের  প্রথম তথ্য মন্ত্রীর নাম কি",
		"options":["মোস্তাক আহমেদ","তাজউদ্দিন আহমেদ","মনসুর আলি","সৈয়দ নজরুল ইসলাম"],
		"answer":1
	},{
		"question":"বাংলাদেশের  প্রথম শিক্ষা মন্ত্রীর নাম কি",
		"options":["মোস্তাক আহমেদ","তাজউদ্দিন আহমেদ","মনসুর আলি","সৈয়দ নজরুল ইসলাম"],
		"answer":1
	},
	{
		"question":"বাংলাদেশের  প্রথম স্বরাষ্ট্র মন্ত্রীর নাম কি",
		"options":["এ এইচ এম কামরুজ্জামান","তাজউদ্দিন আহমেদ","মনসুর আলি","সৈয়দ নজরুল ইসলাম"],
		"answer":0
	},
	{
		"question":"বাংলাদেশের  প্রথম  কৃষি মন্ত্রীর নাম কি",
		"options":["এ এইচ এম কামরুজ্জামান","তাজউদ্দিন আহমেদ","মনসুর আলি","সৈয়দ নজরুল ইসলাম"],
		"answer":0
	},
	{
		"question":"বাংলাদেশের  প্রথম অর্থ মন্ত্রীর নাম কি",
		"options":["এ এইচ এম কামরুজ্জামান","তাজউদ্দিন আহমেদ","মনসুর আলি","সৈয়দ নজরুল ইসলাম"],
		"answer":3
	},
	{
		"question":"পদ্মা সেতুর দৈর্ঘ্য কত?",
		"options":["৬.৯ কি.মি.","১২.২ কি.মি.","৬.১৫ কি.মি.","৭.২ কি.মি."],
		"answer":2
	},
	{
		"question":"স্বাধীন বাংলা বেতার কেন্দ্র কোথায় স্থাপিত হয়?",
		"options":["হালুয়াঘাট","মির্জাপুর","রাঙ্গামাটি","কালুরঘাট"],
		"answer":3
	},
	{
		"question":"স্বাধীন বাংলা বেতার কেন্দ্র হতে চরমপত্র পাঠ করতেন কে?",
		"options":["এম.আর. আখতার মুকুল","তোফায়েল আহমেদ","আব্দুর রাজ্জাক","আব্দুল গাফফার চৌধুরী"],
		"answer":0
	} ,
	{
		"question":"মুক্তিযুদ্ধে বাংলাদেশকে কতটি সেক্টরে ভাগ করা হয়?",
		"options":["১০","৪","১২","১১"],
		"answer":3
	} ,
	{
		"question":"মক্তিযুদ্ধের সময় ১ নং সেক্টর কোনটি ছিল?",
		"options":["চট্টগ্রাম","রংপুর","রাজশাহি","ঢাকা"],
		"answer":0
	} ,
	{
		"question":"মুক্তিযুদ্ধের সময় ঢাকা কত নং সেক্টরে ছিল?",
		"options":["৫","১","২","৩"],
		"answer":2
	} ,
	{
		"question":"বাংলাদেশের সর্বোচ্চ সামরিক খেতাব কোনটি?",
		"options":["বীর উত্তম","বীর বিক্রম","বীর প্রতিক","বীর শ্রেষ্ঠ"],
		"answer":3
	} ,

		{"question":"কে বীরশ্রেষ্ঠ নন?",
		"options":["হামিদুর রহমান","মতিউর রহমান","হাফিজুর রহমান","মুন্সি আব্দুর রউফ"],
		"answer":2
	},
	{
		"question":"ফেইসবুকের প্রতিষ্ঠাতা কে?",
		"options":["মার্ক ওয়াহ","মার্ক জুকারবার্গ","মার্ক টোয়েন","মার্ক রিটার বাগ"],
		"answer":1
	},
	{
		"question":"গুগলের প্রতিষ্ঠাতা কে?",
		"options":["মার্ক জুকার বার্গ","ল্যারি পেইজ","ইসাবেলা পেরন","পল এলেন"],
		"answer":1
	},{
		"question":"কমপিউটারের আবিষ্কারক কে?",
		"options":["চার্লস বেবেজ","কেপ কেনেডি","ল্যারি পেইজ","রেডেকা বেরেন"],
		"answer":0
	},{
		"question":"মোবাইলের  আবিষ্কারক কে?",
		"options":["চার্লস বেবেজ","ল্যারি প্যাইজ","হ্যারি কুপার","মর্টিন কুপার"],
		"answer":3
	},{
		"question":"রবীন্দ্রনাথ কত সালে নোবেল পান?",
		"options":["১৯২৮","১৯১৪","১৯১৩","১৯৩২"],
		"answer":2
	},{
		"question":"ব্যানবেইস কত সালে প্রতিষ্ঠিত হয়?",
		"options":["১৯৮৫","১৯৫৪","১৯৭৭","১৯৮৭"],
		"answer":2
	},{
		"question":"বাংলাদেশ ক্রিকেট টিমের বর্তমান ওয়ানডে অধিনায়ক কে?",
		"options":["মাশরাফি বিন মর্তুজা","সাকিব আল হাসান","মাহমুদ-উল্লাহ","মুশফিকুর রহমান"],
		"answer":0
	},
	{
		"question":"বাংলাদেশ ক্রিকেট টিমের বর্তমান টেস্ট অধিনায়ক কে?",
		"options":["মাশরাফি বিন মর্তুজা","সাকিব আল হাসান","মাহমুদ-উল্লাহ","মুশফিকুর রহমান"],
		"answer":1
	},
	{
		"question":"এশিয়াকাপ ক্রিকেটের বর্তমান রানারআপ কোন দেশ?",
		"options":["বাংলাদেশ","পাকিস্তান","শ্রীলংকা","ভারত"],
		"answer":0
	},
    {
		"question":"এশিয়াকাপ ক্রিকেটের বর্তমান চ্যাম্পিয়ন কোন দেশ?",
		"options":["বাংলাদেশ","পাকিস্তান","শ্রীলংকা","ভারত"],
		"answer":3
	},
	{
		"question":"মুক্তিযুদ্ধের বিরোধিতাকারী দেশ কোনটি ?",
		"options":["ব্রিটেন","ভারত","নেপাল","যুক্তরাষ্ট্র"],
		"answer":3
	},
    {
		"question":"জাতিসংঘে বাংলাদেশে সদস্যপদ লাভের বিরুদ্ধে  ভেটো প্রদানকারী  রাষ্ট্র কোনটি?",
		"options":["ফ্রান্স","চীন","যুক্তরাষ্ট্র","ব্রিটেন"],
		"answer":1
	},
	{
		"question":"কোন দেশ বাংলাদেশকে প্রথম স্বীকৃতি প্রদান করে?",
		"options":["ভারত","নেপাল","ভুটান","ইতালি"],
		"answer":0
	},
	{
		"question":"বাংলাদেশকে স্বীকৃতি প্রদানকারী প্রথম ইউরোপীয় দেশ কোনটি?",
		"options":["বেলজিয়াম","গ্রিন্স","স্পেন","পূর্ব জার্মানি"],
		"answer":3
	},
{
		"question":"বাংলাদেশকে স্বীকৃতি প্রদানকারী প্রথম আফ্রিকান দেশ কোনটি?",
		"options":["সেনেগাল","নাইজেরিয়া","মরোক্ক","কেনিয়া"],
		"answer":0
	},
	{
		"question":"কোন মুসলিম রাষ্ট্র বাংলাদেশকে প্রথম স্বীকৃতি প্রদান করে?",
		"options":["ইরাক","ইরান","মিশর","কাতার"],
		"answer":0
	},
	{
		"question":"বাংলাদেশ প্রথম কোন আন্তর্জাতিক সংস্থার সদস্যপদ লাভ করে?",
		"options":["আরব লীগ","ন্যাম","জাতিসংঘ","কমনওয়েলথ"],
		"answer":3
	},
	{
		"question":"বাংলাদেশ কমনওয়েলথের কততম সদস্য?",
		"options":["৩০","৩২","৩৪","৩৬"],
		"answer":1
	},
	{
		"question":"বাংলাদেশ জাতিসংঘের কততম সদস্য?",
		"options":["১৩০","১৩৬","১৩৭","১৪০"],
		"answer":1
	},
	{
		"question":"বাংলাদেশ কোন সংস্থার সদস্য নয়?",
		"options":["D-8","NAM","BIMSTEC","G-7"],
		"answer":3
	},
	{
		"question":"জাতিসংঘের কততম অধিবেশনে বাংলাদেশ সদস্য পদ লাভ করে?",
		"options":["২৭তম","২৮তম","২৯তম","৩০তম"],
		"answer":2
	},
{
		"question":"বাংলাদেশের মোট আয়তন?",
		"options":["১৪৭৭৭০","১৪৬৭৮০","১৪৭৫৭০","১৪৬৮৫০"],
		"answer":2
	},
	{
		"question":"আয়তনের দিক দিয়ে  বিশ্বের  বাংলাদোশের অবস্থান কত?",
		"options":["৯০তম","৯৫তম","১০০তম","১০৫তম"],
		"answer":1
	},
	{
		"question":"বাংলাদেশের মোট  সীমানা কত?",
		"options":["৫১৩৮কি.মি","৫১৪০কি.মি","৫১৪৫কি.মি","৫১৫০কি.মি"],
		"answer":0
	},
	{
		"question":"বাংলাদেশের সমুদ্র উপকূলের মোট দৈর্ঘ্য কত?",
		"options":["৭১৫কি.মি","৭২৪কি.মি","৭৮০কি.মি","৮৬৫কি.মি"],
		"answer":0
	},
	{
		"question":"মিয়ানমারের সাথে বাংলাদেশের সীমান্তের দৈর্ঘ্য কত?",
		"options":["১৮০কি.মি","২৮৩কি .মি","২০০কি.মি","২৫০কি.মি"],
		"answer":1
	},
	{
		"question":"বাংলাদেশের উত্তরে কোনটির অবস্থান?",
		"options":["মিজোরাম","মিঘালয়","ত্রিপুরা","মায়ানমার"],
		"answer":1
	},
	{
		"question":"ভারতের সাথে বাংলাদেশের সীমান্তা জেলা কয়টি?",
		"options":["৩০","৩২","৩৪","৩৬"],
		"answer":0
	},
	{
		"question":"বিলোনিয়া সীমান্ত কোন জেলা অন্তর্গত?",
		"options":["সাতক্ষীরা","যশোর","খুলনা","ফেনী"],
		"answer":3
		
	},
	{
		"question":"পাদুয়া স্থানটি বাংলাদেশের কোন জেলার সীমাস্ত অবস্থিত?",
		"options":["কুড়িগ্রাম","সিলেট","মৌলভীবাজার","রংপুর"],
		"answer":1
	},
	{
		"question":"বাংলাদেশ সবচেয়ে উত্তরে জেলা কোনটি?",
		"options":["দিনাজপুর","ঠাকুরগাঁ","লালমনিরহাট","পঞ্চগড়"],
		"answer":3
	},
	{
		"question":"তেতুলিয়া কোন জেলা অবস্থিত?",
		"options":["ঢাকা","রংপুর","দিনাজপুর","পঞ্চগড়"],
		"answer":3
	},
	{
		"question":"বাংলাদেশ সবচেয়ে দক্ষিণের জেলা কোনটি?",
		"options":["ফেনী","ভোলা","পটুয়াখালী","কক্সবাজার"],
		"answer":3
	},
	{
		"question":"বাংলাদেশের সর্বদক্ষিণের শহর কোনটি?",
		"options":["সেুনামগঞ্জ","কক্সবাজার","টেকনাফ","ঠাকুরগাঁ"],
		"answer":2
	},
	{
		"question":"বাংলাদেশের শীতলতম স্থান কোনটি ?",
		"options":["লালমাই","শীমঙ্গল","লালপুর","লালখান"],
		"answer":3
	},
	{
		"question":"বাংলাদেশের শীতলতম মাস কোনটি?",
		"options":["জানুয়ারী","মার্চ","ডিসেম্বর","নভেম্বর"],
		"answer":0
	},
	{
		"question":"বাকল্যান্ড বাঁধ কোন নদীর তীরে অবস্থিত?",
		"options":["শীললক্ষ্য","বুড়িগঙ্গা","মেঘনা","তুরাগ"],
		"answer":1
	},
	{
		"question":"তিস্তা বাঁধ বাংলাদেশের কোন জেলায় অবস্থিত?",
		"options":["খুলনা","লালমনিরহাট","পাবনা","কুষ্টিয়া"],
		"answer":1
	},
	{
		"question":"ভূ-প্রকৃতি অনুযায়ী বাংলাদেশকে ভাগ করা হয়েছে?",
		"options":["৩টি অঞ্চল","৪টি ","৫টি","৬টি"],
		"answer":0
	},
	{
		"question":"বাংলাদেশের র্সবোচ্চ  পর্বতশৃ্ঙ্গের নাম কী?",
		"options":["বিজয়","লালমাই","বাটালি","কেওক্রাডং"],
		"answer":0
	},
	{
		"question":"বাংলাদেশের র্সবোচ্চ পাহাড় কোনটি?",
		"options":["গারো পাহার","লালমাই পাহার","চিম্বুক পাহার","কুলাউড়া পাহার"],
		"answer":0
	},
	{
		"question":"গারো পাহার কোন জেলায় অবস্থিত?",
		"options":["চট্টগ্রাম","ময়মনসিংহ","সিলেট","কক্সবাজার"],
		"answer":1
	},
	{
		"question":"লালমাই পাহার কোন জেলায় অবস্থিত?",
		"options":["সিলেট","পার্বত্য চট্টগ্রাম","চট্টগ্রাম","কুমিল্লা"],
		"answer":3
	},
	{
		"question":"জৈয়ন্তিকা পাহার কোথায় অবস্থিত?",
		"options":["ময়মনসিংহ","সিলেট","রাঙ্গামাটি","বান্দরবান"],
		"answer":1
	},
	{
		"question":"বাংলাদেশে মিঠা পানির মাছের উৎস?",
		"options":["চলন বিল","হাকালুকি","হাইল","সবগুলোই"],
		"answer":3
	},
	{
		"question":"ভবদহ বিল কোথায় অবস্থিত?",
		"options":["ফরিদপুরে","জামালপুর","পটুয়াখালী","যশোরে"],
		"answer":3
	},
	{
		"question":"বাংলাদেশের বৃহত্তম হাওড়?",
		"options":["পাথরাওলি","হাইল","চলন বিল","হাকালুকি"],
		"answer":3
	},
	{
		"question":"হাকালুকি একটি?",
		"options":["বনভূমি","নদী","হাওর","পাহার"],
		"answer":2
	},
	{
		"question":"বাংলাদেশের বৃহত্তম নদী?",
		"options":["পদ্মা","মেঘনা","যমুনা","গোমতী"],
		"answer":1
	},
	{
		"question":"বাংলাদেশের দীর্ঘতম নদী?",
		"options":["মেঘনা","যমুনা","পদ্মা","কর্ণফুলী"],
		"answer":0
	},
	{
		"question":"বাংলাদেশের সবচেয়ে নাব্য নদী কোনটি?",
		"options":["পদ্মা","মেঘনা","যমুনা","কর্ণফুলী"],
		"answer":1
	},
	{
		"question":"বাংলাদেশের গভীরতম নদী কোনটি?",
		"options":["যমুনা","মেঘনা","পদ্মা","ধলেশ্বরী"],
		"answer":1
	},
	{
		"question":"কোনটি নদ?",
		"options":["মেঘনা","যমুনা","তিস্তা","ব্রহ্মপুত্র"],
		"answer":3
	},
	{
		"question":"কোনটি নদ নয়?",
		"options":["ব্রহ্মপুত্র","কপোতাক্ষ","সিন্ধু","মেঘনা"],
		"answer":3
	},
	{
		"question":"ভারত -বাংলাদেশ যৌথ নদী কমিশন গঠিত হয়?",
		"options":["১৯৭২সালে","১৯৭৪সালে","১৯৮৫সালে","১৯৯১সালে"],
		"answer":0
	},
	{
		"question":"বাংলাদেশের নদী গবেষণা ইনস্টিটিউট কোথায?",
		"options":["ফরিদপুর","চাদপুর","চট্টগ্রাম","নারায়নগঞ্জ"],
		"answer":0
	},
	{
		"question":"পদ্মা নদীর উৎপত্তি?",
		"options":["হিমালয় পর্বতে","লুসাই পাহাড়ে","হিমালয়ের মানস সরোবরে","কোনটিই নয়"],
		"answer":0
	},
	{
		"question":"কর্ণফুলি নদীর উৎস ভারতের কোন রাজ্যে?",
		"options":["ত্রিপুরা","মিজোরাম","মণিপুর","মেঘালয়"],
		"answer":1
	},
	{
		"question":"হালদা ভ্যালি কোথায় অবস্থিত?",
		"options":["রাঙ্গামাটি","খাগড়াছরি","বান্দরবান","সন্দ্বীপ"],
		"answer":1
	},
	{
		"question":"কোন নদীর অপর নাম কীর্তিনাশা?",
		"options":["পদ্মা","যমুনা","মেঘনা","ব্রহ্মপুত্র"],
		"answer":0
	},
	{
		"question":"মহানন্দা কোন নদীর উপনদী?",
		"options":["মেঘনা","যমুনা","কর্ণফুলি","পদ্মা"],
		"answer":3
	},
	{
		"question":"ফারাক্কা বাঁধ তৈরী করা হয়েছে কোন নদীর উপর?",
		"options":["মেঘনা","পদ্মা","যমুনা","গঙ্গা"],
		"answer":3
	},
	{
		"question":"ফারাক্কা বাঁধ পরীক্ষামূলকভাবে চালু হয়েছিল কোন সালে?",
		"options":["১৯৭৪","১৯৭৫","১৯৭৬","১৯৮০"],
		"answer":1
	},
	{
		"question":"ফারাক্কা বাঁধ চালু হয় কবে?",
		"options":["১৯৭৫","১৯৬৯","১৯৭০","১৯৭৩"],
		"answer":0
	},
	{
		"question":"গঙ্গার পানি বন্টন চুক্তি প্রথম কোন সালে স্বাক্ষরিত হয়?",
		"options":["১৯৭৬","১৯৭৭","১৯৭৮","১৯৮০"],
		"answer":1
	},
	{
		"question":"কোনটি আন্তর্জাতিক নদী?",
		"options":["সুরমা","কপোতাক্ষ","ব্রহ্মপুত্র","মেঘনা"],
		"answer":2
	},
	{
		"question":"যমুনা নদী কোথায় পতিত হয়েছে?",
		"options":["পদ্মা","বঙ্গোপসাগর","ব্রহ্মপুত্র","মেঘনা"],
		"answer":0
	},
	{
		"question":"যমুনার উপনদী কোনটি?",
		"options":["তিস্তা","ধলেশ্বরী","শীতালক্ষ্যা","খোয়াই"],
		"answer":0
	},
	{
		"question":"বুড়িগঙ্গা নদীটি?",
		"options":["ধলেশ্বীর উপ নদী","শীতালক্ষ্যার শাখা নদী","তুরাগ নদীর শাখা নদী","ধলেশ্বরীর শাখা নদী"],
		"answer":3
	},
	{
		"question":"কোন নদীর ভারতীয় অংশের নাম বরাক?",
		"options":["পদ্মা","মেঘনা","যমুনা","তিস্তা"],
		"answer":1
	},
	{
		"question":"পদ্মা ও মেঘনা কোথায় মিলিত হয়েছে?",
		"options":["সিরাজগঞ্জ","গোয়ালন্দ","চাদপুর","নগরবাড়ী"],
		"answer":2
	},
	{
		"question":"বাংলাদেশের ও মিয়ানমারকে বিভক্তকারী নাফ নদীর দৈর্ঘ্য কত?",
		"options":["৫০কি.মি","৭৫কি.মি","৫৬কি.মি","৬৫কি.মি"],
		"answer":2
	},
	{
		"question":"বরিশাল কোন নদীর তীরে অবস্থিত?",
		"options":["কীর্তনখোলা","মেঘনা","আড়িয়াল খাঁ","কোনটিই নয়"],
		"answer":0
	},
	{
		"question":"রংপুর দিয়ে প্রবাহিত নদীর নাম?",
		"options":["ঘানট","বাসলী","তিস্তা","ধরলা"],
		"answer":2
	},
	{
		"question":"বাংলাদেশে জলপ্রপাত রয়েছে?",
		"options":["জাফলং","রাঙ্গামাটি","মাধবকুন্ড","হিমছড়ি"],
		"answer":3
	},
	{
		"question":"বগা লেক নামে পরিচিত লেকটি বাংলাদেশের কোন জেলায় অবস্থিত?",
		"options":["সুনামগঞ্জ","বান্দরবান","রাঙ্গামাটি","কিশোরগঞ্জ"],
		"answer":1
	},
	{
		"question":"কোন সমুদ্র সৈকতকে বাংলাদেশের সাগরকন্যা বলা হয়?",
		"options":["কক্সবাজার","সেন্টমাটির্ন ","পতেঙ্গা","কুয়াকাটা"],
		"answer":3
	},
	{
		"question":"টেকনাফ কোন নদীর তীরে অবস্থিত?",
		"options":["পদ্মা","যমুনা","নাফ","কর্ণফুলি"],
		"answer":2
	},
	{
		"question":"কতুবদিয়া কোন জেলায় অবস্থিত?",
		"options":["লক্ষীপুর","কক্সবাজার","নোয়াখালী","চট্টগ্রাম"],
		"answer":1
	},
	{
		"question":"বাংলাদেশের জাতীয়তা?",
		"options":["বাঙালি","বাংলাদেশী","উভয়ই","কোনটিই নয়"],
		"answer":1
	},
	{
		"question":"বাংলাদেশের সংবিধানের মূলনীতি কয়টি?",
		"options":["১১টি","৬টি","৫টি","৪টি"],
		"answer":3
	},
	{
		"question":"মানুষের মৌলিক চাহিদা কয়টি?",
		"options":["৫টি","৪টি","৩টি","৭টি"],
		"answer":0
	},
	{
		"question":"বাংলাদেশের জাতীয় পতাকার রং কয়টি?",
		"options":["২টি","৩টি","৪টি","৫টি"],
		"answer":0
	},
	{
		"question":"জাতীয় পতাকা বিধি কোন সালে প্রণীত হয়?",
		"options":["১৯৭৩","১৯৯২","১৯৭২","১৯৭৫"],
		"answer":2
	},
	/* 
	{
		"question":"",
		"options":["","","",""],
		"answer":0
	} 
	*/
	];
	
	//randomly select question
    $scope.question = $scope.questions[Math.floor(Math.random() * $scope.questions.length)];
	console.log($scope.question);
	
	//go to home
	$scope.click= function(){
		console.log($scope.questions.length)
		window.location.replace('index.html');
	}
	
	//checking answer
	
	$scope.checkAnswer = function(answer, question){
		
		$scope.answered = true;
		
		if(answer==question.answer){
			$scope.corrected++;
			$scope.award = true;
		}else{
			$scope.fail = true;
		}
		
	}
	
	
});